In [1]:
%load_ext sql
%sql postgresql://postgres:123@localhost/sakila

In [2]:
%%sql
-- Farklı alanlarda bulunan isim ve soyisimi birleştirme
SELECT 
    first_name,
    last_name,
    first_name || ' ' || last_name AS full_name
FROM customer
LIMIT 5;

 * postgresql://postgres:***@localhost/sakila
5 rows affected.

[('MARY', 'SMITH', 'MARY SMITH'),
 ('PATRICIA', 'JOHNSON', 'PATRICIA JOHNSON'),
 ('LINDA', 'WILLIAMS', 'LINDA WILLIAMS'),
 ('BARBARA', 'JONES', 'BARBARA JONES'),
 ('ELIZABETH', 'BROWN', 'ELIZABETH BROWN')]

In [3]:
%%sql
-- Farklı alanlarda bulunan isim ve soyisimi birleştirme
SELECT 
    first_name,
    last_name,
    CONCAT(first_name, ' ', last_name) AS full_name
FROM customer
LIMIT 5;

 * postgresql://postgres:***@localhost/sakila
5 rows affected.

[('MARY', 'SMITH', 'MARY SMITH'),
 ('PATRICIA', 'JOHNSON', 'PATRICIA JOHNSON'),
 ('LINDA', 'WILLIAMS', 'LINDA WILLIAMS'),
 ('BARBARA', 'JONES', 'BARBARA JONES'),
 ('ELIZABETH', 'BROWN', 'ELIZABETH BROWN')]

In [4]:
%%sql
-- Büyük/Küçük harf dönüşümü
SELECT 
    LOWER(first_name),
    last_name,
    CONCAT(INITCAP(first_name), ' ', last_name) AS full_name
FROM customer
LIMIT 5;

 * postgresql://postgres:***@localhost/sakila
5 rows affected.

[('mary', 'SMITH', 'Mary SMITH'),
 ('patricia', 'JOHNSON', 'Patricia JOHNSON'),
 ('linda', 'WILLIAMS', 'Linda WILLIAMS'),
 ('barbara', 'JONES', 'Barbara JONES'),
 ('elizabeth', 'BROWN', 'Elizabeth BROWN')]

In [5]:
%%sql
-- Yanlış yazılmış olan A Epic'i An Epic ile değiştirme
SELECT 
    REPLACE(description,'A Epic','An Epic')
FROM film LIMIT 5;

 * postgresql://postgres:***@localhost/sakila
5 rows affected.

[('An Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies',),
 ('A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China',),
 ('A Astounding Reflection of a Lumberjack And a Car who must Sink a Lumberjack in A Baloon Factory',),
 ('A Fanciful Documentary of a Frisbee And a Lumberjack who must Chase a Monkey in A Shark Tank',),
 ('A Fast-Paced Documentary of a Pastry Chef And a Dentist who must Pursue a Forensic Psychologist in The Gulf of Mexico',)]

In [6]:
%%sql
-- Yanlış yazılmış olan A Epic ve A Astounding'i An Epic ve An Astounding ile değiştirme
SELECT 
    REPLACE(REPLACE(description,'A Epic','An Epic'),'A Astounding','An Astounding')
FROM film LIMIT 5;

 * postgresql://postgres:***@localhost/sakila
5 rows affected.

[('An Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies',),
 ('An Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China',),
 ('An Astounding Reflection of a Lumberjack And a Car who must Sink a Lumberjack in A Baloon Factory',),
 ('A Fanciful Documentary of a Frisbee And a Lumberjack who must Chase a Monkey in A Shark Tank',),
 ('A Fast-Paced Documentary of a Pastry Chef And a Dentist who must Pursue a Forensic Psychologist in The Gulf of Mexico',)]

In [7]:
%%sql
-- Film isimleri ve karakter sayıları
SELECT 
    title,
    LENGTH(title) AS desc_len
FROM film
LIMIT 5;

 * postgresql://postgres:***@localhost/sakila
5 rows affected.

[('ACADEMY DINOSAUR', 16),
 ('ACE GOLDFINGER', 14),
 ('ADAPTATION HOLES', 16),
 ('AFFAIR PREJUDICE', 16),
 ('AFRICAN EGG', 11)]

In [8]:
%%sql
-- Müşterilerin e-posta adreslerinde bulunan @ karakterinin pozisyonu
SELECT 
    email,
    POSITION('@' IN email) AS position
FROM customer
ORDER BY position DESC
LIMIT 10;

 * postgresql://postgres:***@localhost/sakila
10 rows affected.

[('MITCHELL.WESTMORELAND@sakilacustomer.org', 22),
 ('JONATHAN.SCARBOROUGH@sakilacustomer.org', 21),
 ('WILLIAM.SATTERFIELD@sakilacustomer.org', 20),
 ('TERRENCE.GUNDERSON@sakilacustomer.org', 19),
 ('STEPHANIE.MITCHELL@sakilacustomer.org', 19),
 ('CATHERINE.CAMPBELL@sakilacustomer.org', 19),
 ('FERNANDO.CHURCHILL@sakilacustomer.org', 19),
 ('FRANCISCO.SKIDMORE@sakilacustomer.org', 19),
 ('NELSON.CHRISTENSON@sakilacustomer.org', 19),
 ('CHRISTINE.ROBERTS@sakilacustomer.org', 18)]

In [9]:
%%sql
-- Müşterilerin e-posta adreslerinde bulunan @ karakterinin pozisyonu
SELECT 
    email,
    STRPOS(email, '@') AS position
FROM customer
ORDER BY position DESC
LIMIT 10;

 * postgresql://postgres:***@localhost/sakila
10 rows affected.

[('MITCHELL.WESTMORELAND@sakilacustomer.org', 22),
 ('JONATHAN.SCARBOROUGH@sakilacustomer.org', 21),
 ('WILLIAM.SATTERFIELD@sakilacustomer.org', 20),
 ('TERRENCE.GUNDERSON@sakilacustomer.org', 19),
 ('STEPHANIE.MITCHELL@sakilacustomer.org', 19),
 ('CATHERINE.CAMPBELL@sakilacustomer.org', 19),
 ('FERNANDO.CHURCHILL@sakilacustomer.org', 19),
 ('FRANCISCO.SKIDMORE@sakilacustomer.org', 19),
 ('NELSON.CHRISTENSON@sakilacustomer.org', 19),
 ('CHRISTINE.ROBERTS@sakilacustomer.org', 18)]

In [10]:
%%sql
-- Film açıklamalarındaki ilk 50 karakterinin ayrıştırılması
SELECT 
    LEFT(description, 50) AS short_desc
FROM film
LIMIT 10;

 * postgresql://postgres:***@localhost/sakila
10 rows affected.

[('A Epic Drama of a Feminist And a Mad Scientist who',),
 ('A Astounding Epistle of a Database Administrator A',),
 ('A Astounding Reflection of a Lumberjack And a Car ',),
 ('A Fanciful Documentary of a Frisbee And a Lumberja',),
 ('A Fast-Paced Documentary of a Pastry Chef And a De',),
 ('A Intrepid Panorama of a Robot And a Boy who must ',),
 ('A Touching Saga of a Hunter And a Butler who must ',),
 ('A Epic Tale of a Moose And a Girl who must Confron',),
 ('A Thoughtful Panorama of a Database Administrator ',),
 ('A Action-Packed Tale of a Man And a Lumberjack who',)]

In [11]:
%%sql
-- Film açıklamalarındaki son 50 karakterinin ayrıştırılması
SELECT 
    RIGHT(description, 50) AS short_desc
FROM film
LIMIT 10;

 * postgresql://postgres:***@localhost/sakila
10 rows affected.

[(' who must Battle a Teacher in The Canadian Rockies',),
 ('nd a Explorer who must Find a Car in Ancient China',),
 ('Car who must Sink a Lumberjack in A Baloon Factory',),
 ('Lumberjack who must Chase a Monkey in A Shark Tank',),
 ('rsue a Forensic Psychologist in The Gulf of Mexico',),
 ('y who must Escape a Sumo Wrestler in Ancient China',),
 (' a Butler who must Discover a Butler in A Jet Boat',),
 ('a Girl who must Confront a Monkey in Ancient India',),
 ('tist who must Outgun a Mad Scientist in A Jet Boat',),
 ('berjack who must Reach a Feminist in Ancient China',)]

In [12]:
%%sql
-- Adreslerinin sokak isminin ayrıştırılması
SELECT 
    SUBSTRING(address from POSITION(' ' IN address)+1 FOR LENGTH(address))
FROM address
LIMIT 10;

 * postgresql://postgres:***@localhost/sakila
10 rows affected.

[('MySakila Drive',),
 ('MySQL Boulevard',),
 ('Workhaven Lane',),
 ('Lillydale Drive',),
 ('Hanoi Way',),
 ('Loja Avenue',),
 ('Joliet Street',),
 ('Inegl Manor',),
 ('Idfu Parkway',),
 ('Santiago de Compostela Way',)]

In [13]:
%%sql
-- Müşterilerin e-posta adresinin ayrıştırılması 
SELECT
    LEFT(email, POSITION('@' IN email)-1) AS username,
    SUBSTRING(email FROM POSITION('@' IN email)+1 FOR LENGTH(email)) AS domain
FROM customer
LIMIT 10;

 * postgresql://postgres:***@localhost/sakila
10 rows affected.

[('MARY.SMITH', 'sakilacustomer.org'),
 ('PATRICIA.JOHNSON', 'sakilacustomer.org'),
 ('LINDA.WILLIAMS', 'sakilacustomer.org'),
 ('BARBARA.JONES', 'sakilacustomer.org'),
 ('ELIZABETH.BROWN', 'sakilacustomer.org'),
 ('JENNIFER.DAVIS', 'sakilacustomer.org'),
 ('MARIA.MILLER', 'sakilacustomer.org'),
 ('SUSAN.WILSON', 'sakilacustomer.org'),
 ('MARGARET.MOORE', 'sakilacustomer.org'),
 ('DOROTHY.TAYLOR', 'sakilacustomer.org')]

In [14]:
%%sql
-- Herhangi bir şekilde tam olmayan kelime içermeyecek şekilde, film açıklamasının ilk 50 karakteri
SELECT 
    LEFT(description, 50 - 
        POSITION(' ' IN REVERSE(LEFT(description, 50)))
    ) AS first_50,
    LENGTH(LEFT(description, 50 - 
        POSITION(' ' IN REVERSE(LEFT(description, 50)))
    )) AS character_length
FROM 
  film 
LIMIT 5;

 * postgresql://postgres:***@localhost/sakila
5 rows affected.

[('A Epic Drama of a Feminist And a Mad Scientist', 46),
 ('A Astounding Epistle of a Database Administrator', 48),
 ('A Astounding Reflection of a Lumberjack And a Car', 49),
 ('A Fanciful Documentary of a Frisbee And a', 41),
 ('A Fast-Paced Documentary of a Pastry Chef And a', 47)]

In [15]:
%%sql
-- Farklı tablolarda bulunan kategori ve film ismini birleştirme
SELECT 
    CONCAT(UPPER(c.name), ': ', title) AS film_category, 
    TRIM(LPAD(description, 50)) AS film_desc
FROM 
    film AS f 
    INNER JOIN film_category AS fc 
    ON f.film_id = fc.film_id 
    INNER JOIN category AS c 
    ON fc.category_id = c.category_id
LIMIT 5;

 * postgresql://postgres:***@localhost/sakila
5 rows affected.

[('DOCUMENTARY: ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who'),
 ('HORROR: ACE GOLDFINGER', 'A Astounding Epistle of a Database Administrator A'),
 ('DOCUMENTARY: ADAPTATION HOLES', 'A Astounding Reflection of a Lumberjack And a Car'),
 ('HORROR: AFFAIR PREJUDICE', 'A Fanciful Documentary of a Frisbee And a Lumberja'),
 ('FAMILY: AFRICAN EGG', 'A Fast-Paced Documentary of a Pastry Chef And a De')]

In [16]:
%%sql
-- Farklı alanlarda bulunan isim ve soyisimi birleştirme
SELECT 
    RPAD(first_name, LENGTH(first_name)+1) || last_name AS full_name
FROM customer
LIMIT 5;

 * postgresql://postgres:***@localhost/sakila
5 rows affected.

[('MARY SMITH',),
 ('PATRICIA JOHNSON',),
 ('LINDA WILLIAMS',),
 ('BARBARA JONES',),
 ('ELIZABETH BROWN',)]

In [17]:
%%sql
-- Farklı alanlarda bulunan isim ve soyisimi birleştirme
SELECT 
    first_name || LPAD(last_name, LENGTH(last_name)+1) AS full_name
FROM customer
LIMIT 5;

 * postgresql://postgres:***@localhost/sakila
5 rows affected.

[('MARY SMITH',),
 ('PATRICIA JOHNSON',),
 ('LINDA WILLIAMS',),
 ('BARBARA JONES',),
 ('ELIZABETH BROWN',)]